---
title: ConnectionInputPointInfo
classe: Autodesk.Revit.DB.Structure.ConnectionInputPointInfo
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ConnectionInputPointInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 InputMemberIndex { get; set; }` | `connectionInputPointInfo.InputMemberIndex` | Int32 |
| `Boolean IsValidObject { get; }` | `connectionInputPointInfo.IsValidObject` | Boolean |
| `String PointSelectionText { get; set; }` | `connectionInputPointInfo.PointSelectionText` | String |
| `String RestrictionType { get; set; }` | `connectionInputPointInfo.RestrictionType` | String |
| `Void Dispose()` | `connectionInputPointInfo.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```